helper-manifests/storageBench/result-local.log
randrw: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.36
Starting 4 processes
randrw: Laying out IO file (1 file / 1024MiB)

randrw: (groupid=0, jobs=4): err= 0: pid=17: Wed Aug 27 05:10:16 2025
  read: IOPS=6893, BW=26.9MiB/s (28.2MB/s)(1616MiB/60007msec)
    slat (nsec): min=1778, max=407543k, avg=275507.36, stdev=2534493.86
    clat (nsec): min=880, max=43590k, avg=3944.84, stdev=80250.55
     lat (usec): min=2, max=407555, avg=279.45, stdev=2536.33
    clat percentiles (nsec):
     |  1.00th=[   948],  5.00th=[  1012], 10.00th=[  1112], 20.00th=[  1304],
     | 30.00th=[  1480], 40.00th=[  1816], 50.00th=[  3312], 60.00th=[  3888],
     | 70.00th=[  4704], 80.00th=[  5472], 90.00th=[  6944], 95.00th=[ 10560],
     | 99.00th=[ 11840], 99.50th=[ 14912], 99.90th=[ 28032], 99.95th=[ 41216],
     | 99.99th=[117248]
   bw (  KiB/s): min=   64, max=59792, per=100.00%, avg=27650.87, stdev=3850.63, samples=476
   iops        : min=   16, max=14948, avg=6912.43, stdev=962.67, samples=476
  write: IOPS=6896, BW=26.9MiB/s (28.2MB/s)(1617MiB/60007msec); 0 zone resets
    slat (usec): min=2, max=407313, avg=292.75, stdev=2864.13
    clat (nsec): min=892, max=17613k, avg=3460.10, stdev=37764.36
     lat (usec): min=3, max=407325, avg=296.21, stdev=2864.97
    clat percentiles (nsec):
     |  1.00th=[   964],  5.00th=[   996], 10.00th=[  1032], 20.00th=[  1112],
     | 30.00th=[  1224], 40.00th=[  1576], 50.00th=[  3088], 60.00th=[  3600],
     | 70.00th=[  3792], 80.00th=[  4192], 90.00th=[  5984], 95.00th=[ 10560],
     | 99.00th=[ 11840], 99.50th=[ 12864], 99.90th=[ 26752], 99.95th=[ 38144],
     | 99.99th=[102912]
   bw (  KiB/s): min=  111, max=58648, per=100.00%, avg=27729.72, stdev=3833.08, samples=475
   iops        : min=   27, max=14662, avg=6932.16, stdev=958.29, samples=475
  lat (nsec)   : 1000=5.09%
  lat (usec)   : 2=38.94%, 4=24.21%, 10=23.43%, 20=8.16%, 50=0.13%
  lat (usec)   : 100=0.02%, 250=0.01%, 500=0.01%, 750=0.01%
  lat (msec)   : 2=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=2.52%, sys=8.10%, ctx=746457, majf=0, minf=53
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=413651,413859,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=26.9MiB/s (28.2MB/s), 26.9MiB/s-26.9MiB/s (28.2MB/s-28.2MB/s), io=1616MiB (1694MB), run=60007-60007msec
  WRITE: bw=26.9MiB/s (28.2MB/s), 26.9MiB/s-26.9MiB/s (28.2MB/s-28.2MB/s), io=1617MiB (1695MB), run=60007-60007msec

Disk stats (read/write):
  nvme0n1: ios=258052/345232, sectors=2073368/3069961, merge=0/4, ticks=21789/14821356, in_queue=14843174, util=26.60%