helper-manifests/storageBench/result-longhorn.log
randrw: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.36
Starting 4 processes

randrw: (groupid=0, jobs=4): err= 0: pid=17: Wed Aug 27 05:09:03 2025
  read: IOPS=1039, BW=4156KiB/s (4256kB/s)(244MiB/60004msec)
    slat (nsec): min=1962, max=19264k, avg=2189435.18, stdev=2011620.68
    clat (nsec): min=886, max=378667, avg=6354.45, stdev=5384.80
     lat (usec): min=2, max=19268, avg=2195.79, stdev=2013.23
    clat percentiles (nsec):
     |  1.00th=[  1048],  5.00th=[  1592], 10.00th=[  2040], 20.00th=[  2608],
     | 30.00th=[  3088], 40.00th=[  3760], 50.00th=[  5728], 60.00th=[  7776],
     | 70.00th=[  9792], 80.00th=[ 10304], 90.00th=[ 10560], 95.00th=[ 10688],
     | 99.00th=[ 16064], 99.50th=[ 19072], 99.90th=[ 47872], 99.95th=[ 80384],
     | 99.99th=[171008]
   bw (  KiB/s): min= 2240, max= 6984, per=99.70%, avg=4144.81, stdev=256.28, samples=476
   iops        : min=  560, max= 1746, avg=1036.20, stdev=64.07, samples=476
  write: IOPS=1045, BW=4180KiB/s (4281kB/s)(245MiB/60004msec); 0 zone resets
    slat (usec): min=2, max=36460, avg=1631.02, stdev=2604.33
    clat (nsec): min=914, max=253360, avg=4771.21, stdev=4662.37
     lat (usec): min=3, max=36465, avg=1635.79, stdev=2606.60
    clat percentiles (nsec):
     |  1.00th=[   988],  5.00th=[  1064], 10.00th=[  1144], 20.00th=[  1576],
     | 30.00th=[  2576], 40.00th=[  3440], 50.00th=[  3696], 60.00th=[  4016],
     | 70.00th=[  4320], 80.00th=[  9664], 90.00th=[ 10432], 95.00th=[ 10688],
     | 99.00th=[ 14784], 99.50th=[ 18304], 99.90th=[ 38656], 99.95th=[ 61696],
     | 99.99th=[168960]
   bw (  KiB/s): min= 2336, max= 7080, per=99.75%, avg=4170.02, stdev=253.53, samples=476
   iops        : min=  584, max= 1770, avg=1042.50, stdev=63.38, samples=476
  lat (nsec)   : 1000=1.13%
  lat (usec)   : 2=15.66%, 4=34.60%, 10=26.87%, 20=21.39%, 50=0.27%
  lat (usec)   : 100=0.04%, 250=0.03%, 500=0.01%
  cpu          : usr=0.66%, sys=2.03%, ctx=138090, majf=0, minf=44
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=62351,62711,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=4156KiB/s (4256kB/s), 4156KiB/s-4156KiB/s (4256kB/s-4256kB/s), io=244MiB (255MB), run=60004-60004msec
  WRITE: bw=4180KiB/s (4281kB/s), 4180KiB/s-4180KiB/s (4281kB/s-4281kB/s), io=245MiB (257MB), run=60004-60004msec

Disk stats (read/write):
  sdb: ios=51896/45469, sectors=415168/385752, merge=0/5, ticks=83382/616297, in_queue=699679, util=94.47%